Examples/Lagrangian/parser/simplifiedSiwek/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    top
    {
        type            wall;
        nFaces          5;
        startFace       4855;
    }
    bottom
    {
        type            wall;
        nFaces          45;
        startFace       4860;
    }
    walls
    {
        type            wall;
        nFaces          140;
        startFace       4905;
    }
    symmetry
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          100;
        startFace       5045;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          5000;
        startFace       5145;
    }
)

// ************************************************************************* //
